{"id":"paper_ferrofluid_001","title":"Influence of water-based ferrofluid upon chlorophylls in cereals","authors":"Mihaela Răcuciu, Dorina-Emilia Creangă","journal":"Journal of Magnetism and Magnetic Materials","year":"2006","doi":"10.1016/j.jmmm.2006.08.017","url":"https://www.sciencedirect.com/science/article/pii/S0304885306025844","keyAssumptions":"Magnetic materials are inert to biological systems; Traditional fertilizers are only viable nutrient delivery method","citation":"Răcuciu, M., & Creangă, D. E. (2006). Influence of water-based ferrofluid upon chlorophylls in cereals. Journal of Magnetism and Magnetic Materials, 311(1), 182-186.","notes":"First demonstration of beneficial ferrofluid effects on cereal photosynthesis. Water-based ferrofluid (10-250 μL/L) with citric acid stabilization increased chlorophyll and carotenoid content in maize under 50 mT magnetic field.","addedDate":"2025-08-11T23:44:00Z"}
{"id":"paper_ferrofluid_002","title":"Cytogenetic changes induced by aqueous ferrofluids in agricultural plants","authors":"Mihaela Răcuciu, Dorina Creangă","journal":"Journal of Magnetism and Magnetic Materials","year":"2006","doi":"10.1016/j.jmmm.2006.08.016","url":"https://www.sciencedirect.com/science/article/pii/S0304885306025832","keyAssumptions":"Nanoparticles are inherently cytotoxic to plant cells","citation":"Răcuciu, M., & Creangă, D. (2006). Cytogenetic changes induced by aqueous ferrofluids in agricultural plants. Journal of Magnetism and Magnetic Materials, 311(1), 177-181.","notes":"Established dose-response safety profiles for ferrofluid applications. Low concentrations (10-250 μL/L) stimulated cell division in root meristems rather than causing damage.","addedDate":"2025-08-11T23:44:00Z"}
{"id":"paper_nanoiron_001","title":"Effects of Iron Oxide Nanoparticles (Fe3O4) on Growth, Photosynthesis, Antioxidant Activity and Distribution of Mineral Elements in Wheat (Triticum aestivum) Plants","authors":"Yingming Feng, Vladimir D. Kreslavski, Alexander N. Shmarev, Anatoli A. Ivanov, Svetlana K. Zharmukhamedova, Min Yu, Alexey Kosobryukhov","journal":"Plants","year":"2022","doi":"10.3390/plants11141894","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC9322615/","keyAssumptions":"Only dissolved iron forms can be absorbed by plant roots","citation":"Feng, Y., Kreslavski, V. D., Shmarev, A. N., Ivanov, A. A., Zharmukhamedova, S. K., Yu, M., & Kosobryukhov, A. (2022). Effects of Iron Oxide Nanoparticles (Fe3O4) on Growth, Photosynthesis, Antioxidant Activity and Distribution of Mineral Elements in Wheat (Triticum aestivum) Plants. Plants, 11(14), 1894.","notes":"Demonstrated Fe₃O₄ nanoparticles increased wheat chlorophyll content (15-25%), biomass accumulation, and antioxidant enzyme activity. Established wheat as suitable model for iron nanoparticle studies.","addedDate":"2025-08-11T23:44:00Z"}
{"id":"paper_nanoiron_002","title":"Impact of magnetic field on the translocation of iron oxide nanoparticles (Fe3O4) in barley seedlings (Hordeum vulgare L.)","authors":"Huseyin Tombuloglu, Ismail Ercan, Noha Alqahtani, Bayan Alotaibi, Muruj Bamhrez","journal":"3 Biotech","year":"2023","doi":"10.1007/s13205-023-03727-4","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC10409972/","keyAssumptions":"Nanoparticle uptake is passive and cannot be enhanced through external means","citation":"Tombuloglu, H., Ercan, I., Alqahtani, N., Alotaibi, B., & Bamhrez, M. (2023). Impact of magnetic field on the translocation of iron oxide nanoparticles (Fe3O4) in barley seedlings (Hordeum vulgare L.). 3 Biotech, 13(9), 296.","notes":"Magnetic fields increased Fe₃O₄ nanoparticle translocation from roots to shoots by 40-60% in barley seedlings. Introduced concept of magnetically-guided nutrient delivery directly relevant to ferrofluid applications.","addedDate":"2025-08-11T23:44:00Z"}
{"id":"paper_nanoiron_003","title":"Iron Oxide Nanoparticles as a Potential Iron Fertilizer for Peanut (Arachis hypogaea)","authors":"Mengmeng Rui, Chuanxin Ma, Yi Hao, Jing Guo, Yukui Rui, Xinlian Tang, Qi Zhao, Xing Fan, Zetian Zhang, Tianqi Hou, Siyuan Zhu","journal":"Frontiers in Plant Science","year":"2016","doi":"10.3389/fpls.2016.00815","url":"https://www.frontiersin.org/journals/plant-science/articles/10.3389/fpls.2016.00815/full","keyAssumptions":"Nanoparticles will leach from sandy soils like traditional fertilizers","citation":"Rui, M., Ma, C., Hao, Y., Guo, J., Rui, Y., Tang, X., ... & Zhu, S. (2016). Iron oxide nanoparticles as a potential iron fertilizer for peanut (Arachis hypogaea). Frontiers in Plant Science, 7, 815.","notes":"Fe₂O₃ nanoparticles outperformed EDTA-Fe chelates in sandy soils by adsorbing to soil particles and providing sustained release. Demonstrated superior performance in challenging soil conditions.","addedDate":"2025-08-11T23:44:00Z"}
{"id":"paper_chelate_001","title":"Fertigation with Fe-EDTA, Fe-DTPA, and Fe-EDDHA Chelates to Prevent Iron Chlorosis of Sensitive Species in High-pH Soilless Media","authors":"Julie A. Hershkowitz, Mackenzie G. Dey, Royal Heins, Bruce Bugbee","journal":"HortScience","year":"2025","doi":"10.21273/HORTSCI17892-24","url":"https://journals.ashs.org/hortsci/view/journals/hortsci/60/3/article-p404.xml","keyAssumptions":"All iron chelates provide equivalent plant-available iron regardless of conditions","citation":"Hershkowitz, J. A., Dey, M. G., Heins, R., & Bugbee, B. (2025). Fertigation with Fe-EDTA, Fe-DTPA, and Fe-EDDHA chelates to prevent iron chlorosis of sensitive species in high-pH soilless media. HortScience, 60(3), 404-410.","notes":"Quantified pH-dependent chelate effectiveness: Fe-EDDHA (pH 9), Fe-DTPA (pH 7.5), Fe-EDTA (pH 6.5). Cost differences significant: Fe-EDDHA costs 4× Fe-EDTA. Established pH-specific chelate selection guidelines.","addedDate":"2025-08-11T23:44:00Z"}
{"id":"paper_humic_001","title":"Eco-Friendly Iron-Humic Nanofertilizers Synthesis for the Prevention of Iron Chlorosis in Soybean (Glycine max) Grown in Calcareous Soil","authors":"María T. Cieschi, Alexander Yu Polyakov, Vasily A. Lebedev, Dmitry S. Volkov, Denis A. Pankratov, Alexey A. Veligzhanin, Irina V. Perminova, Juan J. Lucena","journal":"Frontiers in Plant Science","year":"2019","doi":"10.3389/fpls.2019.00413","url":"https://www.frontiersin.org/journals/plant-science/articles/10.3389/fpls.2019.00413/full","keyAssumptions":"Only synthetic chelates can provide stable iron delivery in alkaline soils","citation":"Cieschi, M. T., Polyakov, A. Y., Lebedev, V. A., Volkov, D. S., Pankratov, D. A., Veligzhanin, A. A., ... & Lucena, J. J. (2019). Eco-friendly iron-humic nanofertilizers synthesis for the prevention of iron chlorosis in soybean (Glycine max) grown in calcareous soil. Frontiers in Plant Science, 10, 413.","notes":"Iron-humic nanofertilizers showed 35% better uptake than Fe-EDDHA with 60% less environmental persistence using ⁵⁷Fe tracer studies. Demonstrated sustainable alternative to synthetic chelates.","addedDate":"2025-08-11T23:44:00Z"}